Notion de data frame

In [4]:

import numpy as np

noms=['Bob','Jessica','Mary','John','Mel']
employes=np.array([[800.5,25],[1500.65,40],[1800.77,43],[2100.566,32],[1400.56,51]])

In [2]:
employes

array([[ 800.5  ,   25.   ],
       [1500.65 ,   40.   ],
       [1800.77 ,   43.   ],
       [2100.566,   32.   ],
       [1400.56 ,   51.   ]])

In [5]:
import pandas as pd
df_employes=pd.DataFrame([[800.5,25],[1500.65,40],[1800.77,43],[2100.566,32],[1400.56,51]])
df_employes

          0   1
0   800.500  25
1  1500.650  40
2  1800.770  43
3  2100.566  32
4  1400.560  51

In [6]:
df_employes=pd.DataFrame([[800.5,25],[1500.65,40],[1800.77,43],[2100.566,32],[1400.56,51]],index=(noms),columns=['salary','age'])
df_employes

           salary  age
Bob       800.500   25
Jessica  1500.650   40
Mary     1800.770   43
John     2100.566   32
Mel      1400.560   51

In [7]:
df_employes["etat_civil"]=["celibataire","marie","en_couple","complexe","3ed partie"]
df_employes

           salary  age   etat_civil
Bob       800.500   25  celibataire
Jessica  1500.650   40        marie
Mary     1800.770   43    en_couple
John     2100.566   32     complexe
Mel      1400.560   51   3ed partie

In [8]:
df_employes.shape

(5, 3)

In [9]:
df_employes.index

Index(['Bob', 'Jessica', 'Mary', 'John', 'Mel'], dtype='object')

In [10]:
ages=df_employes.age
ages

Bob        25
Jessica    40
Mary       43
John       32
Mel        51
Name: age, dtype: int64

In [12]:
df_employes.index

Index(['Bob', 'Jessica', 'Mary', 'John', 'Mel'], dtype='object')

In [13]:
df_employes.columns

Index(['salary', 'age', 'etat_civil'], dtype='object')

In [14]:
df_employes.dtypes

salary        float64
age             int64
etat_civil     object
dtype: object

In [15]:
df_employes.iloc[0,0]

800.5

In [18]:
df_employes.loc['Bob','age']

25

In [20]:
df_employes.loc[:,'age']

Bob        25
Jessica    40
Mary       43
John       32
Mel        51
Name: age, dtype: int64

In [23]:
df_employes.loc['Bob',:]

salary              800.5
age                    25
etat_civil    celibataire
Name: Bob, dtype: object

In [16]:
df_employes.iloc[-1,-1]

'3ed partie'

In [26]:
df_employes.loc[['Bob','Mary'],'age']

Bob     25
Mary    43
Name: age, dtype: int64

In [27]:
from datetime import datetime

df_employes['dateNaissance']=df_employes['age'].apply(lambda x:datetime.now().year-x)
df_employes

           salary  age   etat_civil  dateNaissance
Bob       800.500   25  celibataire           1997
Jessica  1500.650   40        marie           1982
Mary     1800.770   43    en_couple           1979
John     2100.566   32     complexe           1990
Mel      1400.560   51   3ed partie           1971

In [31]:
def cal_anne_naiss(age):
    return 2022-age

df_employes['anneNaissance']=df_employes['age'].apply(cal_anne_naiss)
df_employes

           salary  age   etat_civil  anneNaissance
Bob       800.500   25  celibataire           1997
Jessica  1500.650   40        marie           1982
Mary     1800.770   43    en_couple           1979
John     2100.566   32           aa           1990
Mel      1400.560   51           bb           1971

In [32]:
from datetime import datetime 

df_employes['anneNaissance'] = datetime.now().year - df_employes['age']
df_employes

           salary  age   etat_civil  dateNaissance  anneNaissance
Bob       800.500   25  celibataire           1997           1997
Jessica  1500.650   40        marie           1982           1982
Mary     1800.770   43    en_couple           1979           1979
John     2100.566   32     complexe           1990           1990
Mel      1400.560   51   3ed partie           1971           1971

In [41]:
df_employes.drop('anneNaissance', axis=1, inplace=True, errors='ignore')

df_employes

           salary   etat_civil  dateNaissance  Raised Salary
Bob       800.500  celibataire           1997      1040.6500
Jessica  1500.650        marie           1982      1950.8450
Mary     1800.770    en_couple           1979      2341.0010
John     2100.566     complexe           1990      2730.7358
Mel      1400.560   3ed partie           1971      1820.7280

Expression lamda

In [ ]:
def somme(x,y): 
    return x+y

In [35]:
somme=lambda x,y: x+y
somme(3,5)

8

In [42]:
# add a new column raised salary
df_employes['Raised Salary'] = df_employes['salary'].apply(lambda raised_salary: raised_salary*1.3)
df_employes

           salary   etat_civil  dateNaissance  Raised Salary
Bob       800.500  celibataire           1997      1040.6500
Jessica  1500.650        marie           1982      1950.8450
Mary     1800.770    en_couple           1979      2341.0010
John     2100.566     complexe           1990      2730.7358
Mel      1400.560   3ed partie           1971      1820.7280